SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-92208-C

Comment( British Rail Standard 9F 2-10-0 Locomotive )
Comment( ******RESISTANCE BASED ON STILL WIND*******)Comment( *********REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( **Known Parameters Required for OR - Wagon Section**)

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( BR_9f_92208_Fitted.s )
Size  ( 2.67691m 4.02714m 12.6837m )
Mass ( 86.7t-uk )

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Break ( 710kN 1220kN )
			r0 ( 0cm 10cm )
		)
		CouplingHasRigidConnection (1)
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Break ( 600kN 1000kN )
			r0 ( 10cm 20cm )
			)
	CouplingHasRigidConnection (0)
	)
	
Comment( ************ Brakes, Type, Force, etc *************** )
BrakeSystemType ( "Vacuum_single_pipe" )
MaxBrakeForce ( 238kN ) Comment(Brake % 69.5 DWt or MTWt CoF 0.5)
MaxHandbrakeForce ( 0kN ) Comment(ctn calc)
Comment(BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )) 

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.85m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 21.0ft 8.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

ORTSDavis_A ( 8078 )
ORTSDavis_B ( 28.99 )
ORTSDavis_C ( 5.449 )

ORTSWagonFrontalArea (102ft^2)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)

Lights ( 2

		Light (
			Comment( Position B )
			Type ( 0 )
			Conditions (
				Headlight ( 4 )
				Unit( 2 )
			)
			Cycle ( 0 )
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			States ( 2
				State (
					Duration ( 0.02 )
					LightColour ( ff808000 )
					Position ( 0.92 1.5 6.31 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.85 )
				)
				State (
					Duration ( 0.2 )
					LightColour ( ccdddddd )
					Position ( 0.92 1.5 6.31 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.8 )
				)
			)
		)
		Light (
			Comment( Position C )
			Type ( 0 )
			Conditions (
				Headlight ( 4 )
				Unit( 2 )
			)
			Cycle ( 0 )
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			States ( 2
				State (
					Duration ( 0.02 )
					LightColour ( ff808000 )
					Position ( 0 1.5 6.31 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.85 )
				)
		
				State (
					Duration ( 0.2 )
					LightColour ( ccdddddd )
					Position ( 0 1.5 6.31 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.8 )
				)
			)
		)
	)

Comment( ******* Miscellaneous Wagon Information************ )

FreightAnim ( CabPlusFitted.s 0 3.0 0.0 )

Comment (Passenger View)	
	Inside (
		WagonShape ( BR_9f_92208_Fitted.s )
        	PassengerCabinHeadPos ( 1.423 3.1 -5 )
        	RotationLimit ( 90 180 160 )
        	StartDirection ( 0 0 0 )
  	)

Sound ( "..\\..\\Common.MEP\\MEPBlack5Sound\\Black5eng.sms" )
)



Engine ( OR-92208-C

Comment( *Known Parameters Required for OR - Engine Section*)

Comment (Section for Engine Effects - Steam Emissions, Stack) 

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

			WhistleFX
			(
				0.35 4.15 -3.2
				0 0 1
				0.15
			)

			SafetyValvesFX
			(
				0.16 4.1 -0.9
				0 1 0
				0.3
			)
			SafetyValvesFX
			(
				-0.16 4.1 -0.9
				0 1 0
				0.3
			)
			StackFX
			(
				0 4.32 4.2
				0 1 0
				0.25
			)
			StackFX
			(
				0 4.32 4.1
				0 1 0
				0.25
			)
			StackFX
			(
				0 4.32 4.0
				0 1 0
				0.25
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-1 -1 -1
				0.05
			)

Comment( 45deg to front and out, x/z,tan45=1 )
			Comment( 20 down and out, -y/x,tan20=0.364 )
			Injectors1FX
			(
				1.15 0.55 -5.1
				1 -0.364 1
				0.2
			)
Comment( 45deg to rear and out, x/-z,tan45=1 )
			Comment( 20 down and out, -y/x,tan20=0.364 )
			Injectors2FX
			(
				1.15 0.55 -5.4 
				1 -0.364 -1
				0.2
			)

			CylindersFX
			(
				-1.052 0.87 4.85
				0 0 1
				0.2
			)

			CylindersFX
			(
				1.052 0.87 4.85
				0 0 1
				0.2
			)
		)
	)

Wagon ( OR-92208-C )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 30in )
NumWheels ( 5 )
ORTSDriveWheelWeight ( 77.5t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 266ft^3 )  
ORTSEvaporationArea ( 2015ft^2 )
ORTSSuperheatArea ( 535ft^2 )
MaxBoilerPressure ( 250psi )
Comment(MaxSteamHeatingPressure ( 80psi )) Comment(Assume no steam heating)

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 2 )
CylinderStroke ( 28in ) 
CylinderDiameter ( 20in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 40.2ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ********************* Fuel ************************* )

MaxTenderCoalMass ( 9t-uk )
MaxTenderWaterMass ( 47250lb )
IsTenderRequired( 1 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

ORTSBoilerEvaporationRate ( 15.2 ) Comment(to give max steam rate 30725lb/hr)

ORTSMaxIndicatedHorsepower ( 2100.0hp )

ORTSMaxSuperheatTemperature ( 350.0 )

ORTSSuperheatCutoffPressureFactor ( 58.0 )Comment(was58)

Comment(ORTSCylinderPortOpening ( 0.085 ))Comment(0.05 to 0.12)

Comment(ORTSBoilerEfficiency( 0.0 0.95  140.0 0.475 ))Comment(Report 8P Gr 16)comment(0 0.97 140.0 0.485)

Comment(ORTSBurnRate( 0.0 10.0   9714.0 1000.0   17714.0 2000.0   23714.0 3000.0   28571.0 4000.0   31428.0 5000.0   33428.0 6000.0  ))


ORTSBoilerEfficiency( 0.0 0.97  102.0 0.61 )comment(Report Gr 16)comment(0 0.97 140.0 0.485)

Comment(ORTSBurnRate( 0.0 10.0   11714.0 1000.0   19714.0 2000.0   25714.0 3000.0   32571.0 4000.0   35428.0 5000.0   37428.0 6000.0  ))

ORTSBurnRate( 0.0 10.0   12000.0 1000.0   21000.0 2000.0   27000.0 3000.0   36000.0 4000.0   37000.0 5000.0   37500.0 6000.0  )

Comment(ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.98 ))

Comment(ORTSCylinderBackPressure ( 0.0 0.0  3000 12.0  ))

    
Comment ( *****************Brake System ******************** )   

TrainBrakesControllerMinSystemPressure( 0 )
TrainBrakesControllerMaxSystemPressure( 21inHg )
BrakeEquipmentType ( "Vacuum_brake, Handbrake " )
BrakeSystemType ( "Vacuum_single_pipe" )

Comment(************Train Control Sysytem (if used)**********        

Includes Monitoring of Overspeed, Vigilance, Emergency Braking 

*************************************************************)

     
Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )
            
Brake_Hand ( 0 1 0.0125 0
	NumNotches ( 0 ))
FireDoor ( 4 4 0.4 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))

Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
SmallEjectorOrCompressor( 0 1 1 )
BellToggle( 0 1 0 )
Headlights( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

CabView ( "Standard9Fx.cvf" )
HeadOut (  -1.423 3.1 -5 )
Sound ( "..\\..\\Common.MEP\\MEPBlack5Sound\\Black5cab.sms" )
Name ( "92208 BR 9F, Class C, BR1G Tender, Coal 7t, Water 5000gal" )
Description (
"The British Railways Standard Class 9F 2-10-0 is a class of steam locomotive designed for British Railways by Robert Riddles. The Class 9F was the last in a series of standardised locomotive classes designed for British Railways during the 1950s, and was intended for use on fast, heavy freight trains over long distances. It was one of the most powerful steam locomotive types ever built for British Railways, and successfully performed its intended duties. The class was given the nickname of 'Spaceships', due to its size and shape.\n"+
"\n"+
"At various times during the 1950s, the 9Fs worked passenger trains with great success, indicating the versatility of the design, sometimes considered to represent the ultimate in British steam development. Several experimental variants were constructed in an effort to reduce costs and maintenance, although these met with varying degrees of success. They were also capable of reaching speeds of up to 90 miles per hour.\n"+
"\n"+
"The 9F was designed at both Derby and Brighton Works in 1951 to operate freight trains of up to 900 tons at 35 mph with maximum fuel efficiency. The original proposal was for a boiler from the BR Standard Class 7 Britannia 4-6-2, adapting it to a 2-8-2 wheel arrangement but Riddles eventually settled upon a 2-10-0 type because it had been used successfully on some of his previous Austerity locomotives. Distributing the adhesive weight over five axles gave a maximum axle load of only 15 tons, 10 cwt. The driving wheels were 5 feet 0 inches in diameter. However, in order to clear the rear coupled wheels, the grate had to be set higher, thus reducing firebox volume. There were many problems associated with locomotives of such a long wheelbase, but these were solved by the design team through a series of compromises. The centre driving wheels had no flanges, and those on the second and fourth coupled wheels were reduced in depth. This enabled the locomotive to round curves of only 400 feet radius. As on all other BR standard steam"+ " locomotives, the leading wheels were 3 feet 0 inches in diameter.\n"+
"\n"+
"Introduced in January 1954, the class comprised 251 locomotives, of which 53 were constructed at Swindon Works, and 198 at Crewe Works. The locomotives were numbered 92000-92250. The last member of the class was constructed at Swindon in 1960, the 999th BR Standard to be constructed, and the last steam locomotive to be built by British Railways. To mark the occasion, a competition was run within the Western Region of British Railways to choose an apt name, and the locomotive was given the name and number of 92220 Evening Star. Many of the class lasted only a few years in service before withdrawal when steam traction ended on the mainline in Britain. Withdrawals of the class from everyday service began in May 1964, and had been completed by June 1968.")
)
